package com.aurora.consumer.admin.util;

/**
 * 项目名称：
 * 创建:BYG 2017/5/25
 * 修改：
 * @version
*/
public class Const {
	
	/**------------------------------------------------------------------------------------------------
	 * -----------------------------------------关键词常量---------------------------------------
	 * ------------------------------------------------------------------------------------------------
	 */	
	
	/**
	 * session用的用户
	 */
	public static final String SESSION_USER = "sessionUser";	
	/**
	 * session中的用户菜单列表
	 */
	public static final String SESSION_USER_MENU = "sessionUserMenu";	
	/**
	 * 默认密码
	 */
	public static final String DEFAULT_PASSWORD = "123456";

	/**------------------------------------------------------------------------------------------------
	 * --------------------------------------地址路径常量--------------------------------------
	 * ------------------------------------------------------------------------------------------------
	 */
	/**
	 * 未认证、未授权可访问路径
	 */
	public static final String[] NO_INTERCEPTOR_PATH = {"/error/**","/login/**","/common/**","/css/**","/img/**","/js/**", 
														"/plugin/**"};
	/**
	 * 登陆路径
	 */
	public static final String LOGIN_PATH = "/login/toLogin";
	/**
	 * 登陆后首页路径
	 */
	public static final String HOME_PATH = "/login/home";
	/**
	 * 退出路径
	 */
	public static final String LOGOUT_PATH = "/login/logout";

	/**------------------------------------------------------------------------------------------------
	 * ------------------------------------------角色常量-----------------------------------------
	 * ------------------------------------------------------------------------------------------------
	 */
	/**
	 * 销售角色id		
	 */
	public static final String SALES_ROLE_ID = "5"; 
	/**
	 * 客服角色id
	 */
	public static final String SERVICE_ROLE_ID = "6"; 
	/**
	 * 运营角色id	
	 */
	public static final String OPERATION_ROLE_ID = "7"; 
	/**
	 * 公池客户编码;	
	 */
	public static final int PUBLIC_POOL_CODE = 888; //使用int 而不是Integer,原因-128~+127Intege比值是可以的,因为Integer是从缓冲区取的,超出就是一个封装过程;

	/**------------------------------------------------------------------------------------------------
	 * ----------------------------------------用户状态-----------------------------------------
	 * ------------------------------------------------------------------------------------------------
	 */
	/**
	 * 禁用用户状态
	 */
	public static final int LOCK_USER_STATUS = 4; //使用int 而不是Integer,原因-128~+127Intege比值是可以的,因为Integer是从缓冲区取的,超出就是一个封装过程;
	
	

	
}
